In [1]:
%load_ext sql

In [2]:
%sql sqlite:///C:\Users\User\Desktop\sql\chinook.db

In [3]:
%%sql
SELECT *
FROM sqlite_master

 * sqlite:///C:\Users\User\Desktop\sql\chinook.db
Done.

[('table', 'albums', 'albums', 2, 'CREATE TABLE "albums"\r\n(\r\n    [AlbumId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Title] NVARCHAR(160)  NOT NULL,\r\n    [ArtistId] INTEGER  NOT NULL,\r\n    FOREIGN KEY ([ArtistId]) REFERENCES "artists" ([ArtistId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'),
 ('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'artists', 'artists', 4, 'CREATE TABLE "artists"\r\n(\r\n    [ArtistId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(120)\r\n)'),
 ('table', 'customers', 'customers', 5, 'CREATE TABLE "customers"\r\n(\r\n    [CustomerId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [FirstName] NVARCHAR(40)  NOT NULL,\r\n    [Last ... (317 characters truncated) ... SupportRepId] INTEGER,\r\n    FOREIGN KEY ([SupportRepId]) REFERENCES "employees" ([EmployeeId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'),
 ('table', 'employees', 'employees', 8, 'CREATE TABLE "employees"\r\n(\r\n    [EmployeeId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [LastName] NVARCHAR(20)  NOT NULL,\r\n    [First ... (356 characters truncated) ...     [Email] NVARCHAR(60),\r\n    FOREIGN KEY ([ReportsTo]) REFERENCES "employees" ([EmployeeId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'),
 ('table', 'genres', 'genres', 10, 'CREATE TABLE "genres"\r\n(\r\n    [GenreId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(120)\r\n)'),
 ('table', 'invoices', 'invoices', 11, 'CREATE TABLE "invoices"\r\n(\r\n    [InvoiceId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [CustomerId] INTEGER  NOT NULL,\r\n    [InvoiceDat ... (226 characters truncated) ... NUMERIC(10,2)  NOT NULL,\r\n    FOREIGN KEY ([CustomerId]) REFERENCES "customers" ([CustomerId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'),
 ('table', 'invoice_items', 'invoice_items', 13, 'CREATE TABLE "invoice_items"\r\n(\r\n    [InvoiceLineId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [InvoiceId] INTEGER  NOT NULL,\r\n    [Tr ... (191 characters truncated) ... TE NO ACTION ON UPDATE NO ACTION,\r\n    FOREIGN KEY ([TrackId]) REFERENCES "tracks" ([TrackId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'),
 ('table', 'media_types', 'media_types', 15, 'CREATE TABLE "media_types"\r\n(\r\n    [MediaTypeId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(120)\r\n)'),
 ('table', 'playlists', 'playlists', 16, 'CREATE TABLE "playlists"\r\n(\r\n    [PlaylistId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(120)\r\n)'),
 ('table', 'playlist_track', 'playlist_track', 17, 'CREATE TABLE "playlist_track"\r\n(\r\n    [PlaylistId] INTEGER  NOT NULL,\r\n    [TrackId] INTEGER  NOT NULL,\r\n    CONSTRAINT [PK_PlaylistTrack] PR ... (125 characters truncated) ... TE NO ACTION ON UPDATE NO ACTION,\r\n    FOREIGN KEY ([TrackId]) REFERENCES "tracks" ([TrackId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'),
 ('index', 'sqlite_autoindex_playlist_track_1', 'playlist_track', 18, None),
 ('table', 'tracks', 'tracks', 20, 'CREATE TABLE "tracks"\r\n(\r\n    [TrackId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(200)  NOT NULL,\r\n    [AlbumId] INTEG ... (415 characters truncated) ... ON UPDATE NO ACTION,\r\n    FOREIGN KEY ([MediaTypeId]) REFERENCES "media_types" ([MediaTypeId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'),
 ('index', 'IFK_AlbumArtistId', 'albums', 22, 'CREATE INDEX [IFK_AlbumArtistId] ON "albums" ([ArtistId])'),
 ('index', 'IFK_CustomerSupportRepId', 'customers', 23, 'CREATE INDEX [IFK_CustomerSupportRepId] ON "customers" ([SupportRepId])'),
 ('index', 'IFK_EmployeeReportsTo', 'employees', 24, 'CREATE INDEX [IFK_EmployeeReportsTo] ON "employees" ([ReportsTo])'),
 ('index', 'IFK_InvoiceCustomerId', 'invoices', 26, 'CREATE INDEX [IFK_InvoiceCustomerId] ON "invoices" ([CustomerId])'),
 ('index', 'IFK_InvoiceLineInvoiceId', 'invoice_items', 27, 'CREATE INDEX [IFK_InvoiceLineInvoiceId] ON "invoice_items" ([InvoiceId])'),
 ('index', 'IFK_InvoiceLineTrackId', 'invoice_items', 28, 'CREATE INDEX [IFK_InvoiceLineTrackId] ON "invoice_items" ([TrackId])'),
 ('index', 'IFK_PlaylistTrackTrackId', 'playlist_track', 29, 'CREATE INDEX [IFK_PlaylistTrackTrackId] ON "playlist_track" ([TrackId])'),
 ('index', 'IFK_TrackAlbumId', 'tracks', 30, 'CREATE INDEX [IFK_TrackAlbumId] ON "tracks" ([AlbumId])'),
 ('index', 'IFK_TrackGenreId', 'tracks', 31, 'CREATE INDEX [IFK_TrackGenreId] ON "tracks" ([GenreId])'),
 ('index', 'IFK_TrackMediaTypeId', 'tracks', 32, 'CREATE INDEX [IFK_TrackMediaTypeId] ON "tracks" ([MediaTypeId])'),
 ('table', 'sqlite_stat1', 'sqlite_stat1', 864, 'CREATE TABLE sqlite_stat1(tbl,idx,stat)')]

In [5]:
%%sql
-- load tables in sql_master
SELECT 
    name
FROM 
    sqlite_master
WHERE
    type = "table"

 * sqlite:///C:\Users\User\Desktop\sql\chinook.db
Done.

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',)]

In [48]:
%%sql
-- 1. Find the top-selling artist in each country
with ArtistSale as (
    SELECT 
        a.name as Name,
        round(sum(item.UnitPrice * item.Quantity), 3) as Total_sales,
        c.Country
    FROM 
        artists as a
    JOIN
        albums as al
    ON 
        a.ArtistId = al.ArtistId
    JOIN
        tracks as t
    ON
        al.AlbumId = t.AlbumId   
    JOIN
        invoice_items as item
    ON
        t.TrackId = item.TrackId  
    JOIN
        invoices as i
    ON 
        item.InvoiceId = i.InvoiceId
    JOIN
        customers as c
    ON
        i.CustomerId = c.CustomerId
    GROUP BY 
            a.name, 
            c.Country
)
SELECT 
    Name,
    country,
    Total_sales,
    Ranking
FROM
    (
        SELECT Name,
        country,
        Total_sales,
        DENSE_RANK() OVER(PARTITION BY Country ORDER BY Total_sales DESC) as Ranking
        FROM ArtistSale
        
    ) ranked

WHERE Ranking = 1
ORDER BY Total_sales DESC
limit 5

 * sqlite:///C:\Users\User\Desktop\sql\chinook.db
Done.

[('The Office', 'USA', 33.83, 1),
 ('Iron Maiden', 'Australia', 17.82, 1),
 ('Lost', 'Czech Republic', 15.92, 1),
 ('Lost', 'Ireland', 15.92, 1),
 ('Os Paralamas Do Sucesso', 'Canada', 15.84, 1)]

In [69]:
%%sql
-- 2. Calculate the running total of sales per year
SELECT 
    strftime("%Y", InvoiceDate) as year,
    sum(Total) as Running_cost
    
FROM invoices
GROUP BY strftime("%Y", InvoiceDate)
ORDER BY year

 * sqlite:///C:\Users\User\Desktop\sql\chinook.db
Done.

[('2009', 449.46),
 ('2010', 481.45),
 ('2011', 469.58),
 ('2012', 477.53),
 ('2013', 450.58)]

In [88]:
%%sql
-- 4. Classify tracks as Short, Medium, or Long based on their duration
SELECT 
    Name as Track_Name,
    (Milliseconds/ 60000) Duration_Min,

    CASE 
        WHEN Milliseconds < 180000 THEN "Short"
        WHEN Milliseconds BETWEEN 180000 AND 300000 THEN "Medium" 
        ELSE "Long"
    END as Duration_category
FROM tracks
ORDER BY Duration_Min DESC
LIMIT 5

 * sqlite:///C:\Users\User\Desktop\sql\chinook.db
Done.

[('Occupation / Precipice', 88, 'Long'),
 ('Through a Looking Glass', 84, 'Long'),
 ('Battlestar Galactica, Pt. 1', 49, 'Long'),
 ('Battlestar Galactica, Pt. 2', 49, 'Long'),
 ('The Man With Nine Lives', 49, 'Long')]

In [115]:
%%sql
-- 5. Get the most popular genre for each country
    with GenreSales as (
    SELECT 
        g.Name as Genre,
        c.Country as Country,
        (item.UnitPrice * item.Quantity) as Revenue
        
    FROM 
        genres as g
    JOIN 
        tracks as t
    ON 
        g.GenreId = t.GenreId
    JOIN 
        invoice_items as item
    ON 
        t.TrackId = item.TrackId
    JOIN
        invoices as i
    ON
        item.InvoiceId = i.InvoiceId
    JOIN
        customers as c
    ON 
        i.CustomerId = c.CustomerId  
    GROUP BY 
        c.Country, g.Name
)
SELECT Genre, Country, Revenue, Ranking
FROM (
    SELECT Genre, Country, Revenue,
    ROW_NUMBER() OVER(PARTITION BY Country ORDER BY Revenue) as Ranking
    FROM GenreSales
)
WHERE Ranking = 1
ORDER BY Country
LIMIT 5

 * sqlite:///C:\Users\User\Desktop\sql\chinook.db
Done.

[('Alternative & Punk', 'Argentina', 0.99, 1),
 ('Blues', 'Australia', 0.99, 1),
 ('Classical', 'Austria', 0.99, 1),
 ('Alternative & Punk', 'Belgium', 0.99, 1),
 ('Alternative & Punk', 'Brazil', 0.99, 1)]